// Написать программу вычисления произведения чисел от 1 до N

Console.Write("Введите число: ");
int N = int.Parse(Console.ReadLine()!);

int ()
